Show / Hide Table of Contents
Class GrpcClient
Client implementation for the Grpc connection.
Inheritance
System.Object
GrpcClient
GrpcSynchronousClient
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaStatiCa.Plugin.Grpc
Assembly: IdeaStatiCa.Plugin.dll
Syntax
public class GrpcClient
Constructors
Improve this Doc   View Source
GrpcClient(String, Int32)
Initializes the IdeaStatiCa Grpc client.
Declaration
public GrpcClient(string clientId, int port)
Parameters
 Type |  Name |  Description
 System.String |  clientId
Current client ID (PID)
 System.Int32 |  port
Port on which the server is running.
Properties
Improve this Doc   View Source
ClientID
ID of the client. Typically the PID of the plugins process.
Declaration
public string ClientID { get; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
IsConnected
Determines whether client is connected.
Declaration
public bool IsConnected { get; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
Port
Servert port.
Declaration
public int Port { get; }
Property Value
 Type |  Description
 System.Int32
Methods
Improve this Doc   View Source
ConnectAsync()
Connects to the server.
Declaration
public Task ConnectAsync()
Returns
 Type |  Description
 System.Threading.Tasks.Task
Improve this Doc   View Source
DisconnectAsync()
Disconnets client from the server.
Declaration
public Task DisconnectAsync()
Returns
 Type |  Description
 System.Threading.Tasks.Task
Improve this Doc   View Source
HandleMessageAsync(GrpcMessage)
Handle incoming messages.
Declaration
protected virtual Task HandleMessageAsync(GrpcMessage message)
Parameters
 Type |  Name |  Description
 GrpcMessage |  message
Message incoming from server.
Returns
 Type |  Description
 System.Threading.Tasks.Task
Improve this Doc   View Source
RegisterHandler(String, IGrpcMessageHandler)
Registers a message handler.
Declaration
public void RegisterHandler(string handlerId, IGrpcMessageHandler handler)
Parameters
 Type |  Name |  Description
 System.String |  handlerId
UniqueID of the handler.
 IGrpcMessageHandler |  handler
Handler implementation.
Improve this Doc   View Source
SendMessageAsync(GrpcMessage)
Sends a message to the server.
Declaration
public Task SendMessageAsync(GrpcMessage message)
Parameters
 Type |  Name |  Description
 GrpcMessage |  message
Grpc message to send.
Returns
 Type |  Description
 System.Threading.Tasks.Task
Improve this Doc   View Source
SendMessageAsync(String, String, String)
Sends a message to the server.
Declaration
public Task SendMessageAsync(string messageName, string data = "", string operationId = null)
Parameters
 Type |  Name |  Description
 System.String |  messageName
Message identificator.
 System.String |  data
Body of the message.
 System.String |  operationId
Returns
 Type |  Description
 System.Threading.Tasks.Task
Events
Improve this Doc   View Source
ClientConnected
Triggered every time client connects. Sends a client ID in args.
Declaration
public event EventHandler ClientConnected
Event Type
 Type |  Description
 System.EventHandler
Improve this Doc   View Source
ClientDisconnected
Triggered when client has disconnected. Sends a client ID in args.
Declaration
public event EventHandler ClientDisconnected
Event Type
 Type |  Description
 System.EventHandler
Improve this Doc   View Source
MessageReceived
Triggered when a message is received from the server.
Declaration
public event EventHandler<GrpcMessage> MessageReceived
Event Type
 Type |  Description
 System.EventHandler<GrpcMessage>
 Improve this Doc
 View Source